# Parameters
nc: 80  # number of classes
scales: # model compound scaling constants, i.e. 'model=SPAFPNn-GELAN.yaml' will call SPAFPN-GELAN.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, RepNCSPELAN4, [256, 128, 64]]
  - [-1, 1, ADown, [256]]  # 3-P3/8
  - [-1, 3, RepNCSPELAN4, [512, 256, 128]]
  - [-1, 1, ADown, [512]]  # 5-P4/16
  - [-1, 3, RepNCSPELAN4, [1024, 512, 256]]
  - [-1, 1, ADown, [1024]]  # 7-P5/32
  - [-1, 3, RepNCSPELAN4, [1024, 512, 256]]
  - [-1, 1, SPPF, [1024, 5]]  # 9

# YOLOv8.0n head
head:
  - [[4, 6, 9], 1, PyramidfusionP4, [512]] # 10

  - [[9, 10], 1, MultGLFPNc, [1024, -2]] # 11
  - [-1, 3, DCNv3C2f, [1024]] # 12
  - [[6, 10, -1], 1, MultGLFPNc, [512, 1, True]] # 13
  - [-1, 3, DCNv3C2f, [512]] # 14
  - [[4, 10, -1], 1, MultGLFPNc, [256, 2, True]] # 15
  - [-1, 3, DCNv3C2f, [256]] # 16

  - [[16, 14, 12], 1, PyramidfusionP4, [512]] # 17

  - [[16, 17], 1, MultGLPANc, [256, 2]] # 18
  - [-1, 3, DCNv3C2f, [256]] # 19
  - [[14, 17, -1], 1, MultGLPANc, [512, 1, True]] # 20
  - [-1, 3, DCNv3C2f, [512]] # 21
  - [[12, 17, -1], 1, MultGLPANc, [1024, -2, True]] # 22
  - [-1, 3, DCNv3C2f, [1024]] # 23

  - [[19, 21, 23], 1, Detect, [nc]]  # Detect(P3, P4, P5)
